import { Divider } from "antd";
import { CSSProperties } from "react";

import styles from "../styles.module.css"
import Tiptap from "@/components/Tiptap";

export default function FaqTextFormattingPage() {
    // TODO: make it page
    /*

    - добавити інформацію про те, що можна робити різні дії
      з текстом (по типу копіювання, вставляння тексту) кнопками на клавіатурі.
    - теж саме, але для таких дій, як зробити текст жирним, курсивом і тд
    - добавити інформацію про те, що текст можна зробити жирним, курсивом і тд
      за допомогою не тільки клавіш, але й таких знаків як *, **, _ і тд
    - добавити інформацію про те, що можна зручно відображати математичні формули
    */
    return (
        <div>
            <h1>Форматування тексту</h1>
            
            <Divider />

            <section className={styles.section}>
              <h3>За допомогою кнопок:</h3>
              <p>
                Виділіть текст, та над ним з'явиться меню в якому будуть доступні такі опції як:
                зробити текст жирним/курсивом; закреслити/підчеркнути текст;
                зробити впорядкований/маркований список (не всюди доступно), як на картинці нижче:
              </p>
              <img style={{display: "block", margin: "auto", marginTop: 10}} src="/imgs/text_formatting.jpg" alt="text formatting bubble menu" />
            </section>

            <section className={styles.section}>
              <h3>Швидке Форматування тексту:</h3>

              <ul>
                <li>
                  Фрагмент тексту, який хочете зробити <b>жирним</b>, напишіть між подвійними зірочками
                  (наприклад: **текст**)
                </li>
                <li>
                  Фрагмент тексту, який хочете зробити <i>курсивом</i>, напишіть між зірочками
                  (наприклад: *текст*)
                </li>
                <li>
                  Фрагмент тексту, який хочете <s>закреслити</s>, напишіть між подвійними тільдами
                  (наприклад: ~~текст~~)
                </li>
                <li>
                  Фрагмент тексту, який хочете <u>підкреслити</u>, напишіть між знаками нижнього підкреслення
                  (наприклад: _текст_)
                </li>
              </ul>
            </section>

            <section className={styles.section}>
              <h3>За допомогою комбінацій клавіш на клавіатурі:</h3>

              <ul>
                <li>
                  Виділіть фрагмент тексту, та нажміть <code>Control + B</code> щоб зробити текст <b>жирним</b>
                </li>
                <li>
                  Виділіть фрагмент тексту, та нажміть <code>Control + I</code> щоб зробити текст <i>курсивом</i>
                </li>
                <li>
                  Виділіть фрагмент тексту, та нажміть <code>Control + U</code> щоб <s>закреслити</s> текст
                </li>
                <li>
                  Виділіть фрагмент тексту, та нажміть <code>Control + Shift + X</code> щоб <u>підкреслити</u> текст
                </li>
              </ul>
            </section>

            <Divider />

            <section className={styles.section}>
              <h3>Щодо математичних формул:</h3>

              <p>
                Напишіть математичну формулу між знаками долара(нижче посилання на сайт, де подробніше про це),
                наприклад: <code>$\sqrt{2}$</code>.
              </p>

              <p>
                Ми використовуємо бібліотеку <a href="https://katex.org/">katex</a>.
                Подробніше про те, які позначення існують, ви можете глянути <a href="https://katex.org/docs/supported.html#operators">тут</a>.
              </p>
            </section>
        </div>
    )
}